Ran Plan for project: `codebuild/zerone-id/tmcd_apnortheast2` dir: `terraform/codebuild/zerone-id/tmcd_apnortheast2` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.deployment_demo.aws_codebuild_project.deployment will be created
+ resource "aws_codebuild_project" "deployment" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 30
      + description          = "To deploy service"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "demo-tmcdapne2"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = "arn:aws:iam::066346343248:role/service-role/codebuild-deployment"
      + tags                 = {
          + "Name"       = "demo"
          + "billing"    = "tmc"
          + "env"        = "tmc"
          + "stack_name" = "tmcd_apnortheast2"
        }
      + tags_all             = {
          + "Name"       = "demo"
          + "billing"    = "tmc"
          + "env"        = "tmc"
          + "stack_name" = "tmcd_apnortheast2"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "NO_ARTIFACTS"
        }

      + cache {
          + type = "NO_CACHE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux2-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"
        }

      + source {
          + buildspec       = "buildspec-codedeploy.yml"
          + git_clone_depth = 1
          + location        = "https://github.com/DevopsArtFactory/springboot-sample.git"
          + type            = "GITHUB"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0fa85f998b145634f",
            ]
          + subnets            = [
              + "subnet-00954dff2b638bdd8",
              + "subnet-08d60c5582e7bab2c",
            ]
          + vpc_id             = "vpc-02bd27f3ad9337b18"
        }
    }

  # module.deployment_test.aws_codebuild_project.deployment will be destroyed
  # (because aws_codebuild_project.deployment is not in configuration)
- resource "aws_codebuild_project" "deployment" {
      - arn                    = "arn:aws:codebuild:ap-northeast-2:066346343248:project/test-tmcdapne2" -> null
      - badge_enabled          = false -> null
      - build_timeout          = 30 -> null
      - concurrent_build_limit = 0 -> null
      - description            = "To deploy service" -> null
      - encryption_key         = "arn:aws:kms:ap-northeast-2:066346343248:alias/aws/s3" -> null
      - id                     = "arn:aws:codebuild:ap-northeast-2:066346343248:project/test-tmcdapne2" -> null
      - name                   = "test-tmcdapne2" -> null
      - project_visibility     = "PRIVATE" -> null
      - queued_timeout         = 480 -> null
      - service_role           = "arn:aws:iam::066346343248:role/service-role/codebuild-deployment" -> null
      - tags                   = {
          - "Name"       = "test"
          - "billing"    = "tmc"
          - "env"        = "tmc"
          - "stack_name" = "tmcd_apnortheast2"
        } -> null
      - tags_all               = {
          - "Name"       = "test"
          - "billing"    = "tmc"
          - "env"        = "tmc"
          - "stack_name" = "tmcd_apnortheast2"
        } -> null

      - artifacts {
          - encryption_disabled    = false -> null
          - override_artifact_name = false -> null
          - type                   = "NO_ARTIFACTS" -> null
        }

      - cache {
          - modes = [] -> null
          - type  = "NO_CACHE" -> null
        }

      - environment {
          - compute_type                = "BUILD_GENERAL1_SMALL" -> null
          - image                       = "aws/codebuild/amazonlinux2-x86_64-standard:5.0" -> null
          - image_pull_credentials_type = "CODEBUILD" -> null
          - privileged_mode             = false -> null
          - type                        = "LINUX_CONTAINER" -> null
        }

      - logs_config {
          - cloudwatch_logs {
              - status = "ENABLED" -> null
            }
          - s3_logs {
              - encryption_disabled = false -> null
              - status              = "DISABLED" -> null
            }
        }

      - source {
          - buildspec           = "buildspec-test.yml" -> null
          - git_clone_depth     = 1 -> null
          - insecure_ssl        = false -> null
          - location            = "https://github.com/DevopsArtFactory/jenkins-deploy-script.git" -> null
          - report_build_status = false -> null
          - type                = "GITHUB" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0fa85f998b145634f",
            ] -> null
          - subnets            = [
              - "subnet-00954dff2b638bdd8",
              - "subnet-08d60c5582e7bab2c",
            ] -> null
          - vpc_id             = "vpc-02bd27f3ad9337b18" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p codebuild/zerone-id/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fcodebuild%252Fzerone-id%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p codebuild/zerone-id/tmcd_apnortheast2`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
